{
    "Adaptability": {
        "description": "This Pokemon's attacks that match one of its types have a STAB modifier of 2 instead of 1.5."
    },
    "Aerilate": {
        "description": "This Pokemon's Normal-type moves become Flying-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects."
    },
    "Aftermath": {
        "description": "If this Pokemon is knocked out with a contact move, that move's user loses 1/4 of its maximum HP, rounded down. If any active Pokemon has the Ability Damp, this effect is prevented."
    },
    "Air Lock": {
        "description": "While this Pokemon is active, the effects of weather conditions are disabled."
    },
    "Analytic": {
        "description": "The power of this Pokemon's move is multiplied by 1.3 if it is the last to move in a turn. Does not affect Doom Desire and Future Sight."
    },
    "Anger Point": {
        "description": "If this Pokemon, but not its substitute, is struck by a critical hit, its Attack is raised by 12 stages."
    },
    "Anticipation": {
        "description": "On switch-in, this Pokemon is alerted if any opposing Pokemon has an attack that is super effective on this Pokemon or an OHKO move. Counter, Metal Burst, and Mirror Coat count as attacking moves of their respective types, while Hidden Power, Judgment, Natural Gift, Techno Blast, and Weather Ball are considered Normal-type moves."
    },
    "Arena Trap": {
        "description": "Prevents adjacent opposing Pokemon from choosing to switch out unless they are immune to trapping or have immunity to Ground."
    },
    "Aroma Veil": {
        "description": "This Pokemon and its allies cannot be affected by Attract, Disable, Encore, Heal Block, Taunt, or Torment."
    },
    "Aura Break": {
        "description": "While this Pokemon is active, the effects of the Abilities Dark Aura and Fairy Aura are reversed, multiplying the power of Dark- and Fairy-type moves, respectively, by 3/4 instead of 1.33."
    },
    "Bad Dreams": {
        "description": "Causes adjacent opposing Pokemon to lose 1/8 of their maximum HP, rounded down, at the end of each turn if they are asleep."
    },
    "Battle Armor": {
        "description": "This Pokemon cannot be struck by a critical hit."
    },
    "Big Pecks": {
        "description": "Prevents other Pokemon from lowering this Pokemon's Defense stat stage."
    },
    "Blaze": {
        "description": "When this Pokemon has 1/3 or less of its maximum HP, rounded down, its attacking stat is multiplied by 1.5 while using a Fire-type attack."
    },
    "Bulletproof": {
        "description": "This Pokemon is immune to bullet moves."
    },
    "Cheek Pouch": {
        "description": "If this Pokemon eats a Berry, it restores 1/3 of its maximum HP, rounded down, in addition to the Berry's effect."
    },
    "Chlorophyll": {
        "description": "If Sunny Day is active, this Pokemon's Speed is doubled."
    },
    "Clear Body": {
        "description": "Prevents other Pokemon from lowering this Pokemon's stat stages."
    },
    "Cloud Nine": {
        "description": "While this Pokemon is active, the effects of weather conditions are disabled."
    },
    "Color Change": {
        "description": "This Pokemon's type changes to match the type of the last move that hit it. This effect applies after all hits from a multi-hit move; Sheer Force prevents it from activating if the attack has a secondary effect."
    },
    "Competitive": {
        "description": "This Pokemon's Special Attack is raised by 2 stages for each of its stat stages that is lowered by an opposing Pokemon."
    },
    "Compoundeyes": {
        "description": "This Pokemon's moves have their accuracy multiplied by 1.3."
    },
    "Contrary": {
        "description": "If this Pokemon has a stat stage raised it is lowered instead, and vice versa."
    },
    "Cursed Body": {
        "description": "If this Pokemon is hit by an attack, there is a 30% chance that move gets disabled unless one of the attacker's moves is already disabled."
    },
    "Cute Charm": {
        "description": "There is a 30% chance a Pokemon making contact with this Pokemon will become infatuated if it is of the opposite gender."
    },
    "Damp": {
        "description": "While this Pokemon is active, Self-Destruct, Explosion, and the Ability Aftermath are prevented from having an effect."
    },
    "Dark Aura": {
        "description": "While this Pokemon is active, the power of Dark-type moves used by active Pokemon is multiplied by 1.33."
    },
    "Defeatist": {
        "description": "While this Pokemon has 1/2 or less of its maximum HP, rounded down, its Attack and Special Attack are halved."
    },
    "Defiant": {
        "description": "This Pokemon's Attack is raised by 2 stages for each of its stat stages that is lowered by an opposing Pokemon."
    },
    "Download": {
        "description": "On switch-in, this Pokemon's Attack or Special Attack is raised by 1 stage based on the weaker combined defensive stat of all opposing Pokemon. Attack is raised if their Defense is lower, and Special Attack is raised if their Special Defense is the same or lower."
    },
    "Drizzle": {
        "description": "On switch-in, this Pokemon summons Rain Dance."
    },
    "Drought": {
        "description": "On switch-in, this Pokemon summons Sunny Day."
    },
    "Dry Skin": {
        "description": "This Pokemon is immune to Water-type moves and restores 1/4 of its maximum HP, rounded down, when hit by a Water-type move. The power of Fire-type moves is multiplied by 1.25 when used on this Pokemon. At the end of each turn, this Pokemon restores 1/8 of its maximum HP, rounded down, if the weather is Rain Dance, and loses 1/8 of its maximum HP, rounded down, if the weather is Sunny Day."
    },
    "Early Bird": {
        "description": "This Pokemon's sleep counter drops by 2 instead of 1."
    },
    "Effect Spore": {
        "description": "There is a 30% chance a Pokemon making contact with this Pokemon will be poisoned, paralyzed, or fall asleep."
    },
    "Fairy Aura": {
        "description": "While this Pokemon is active, the power of Fairy-type moves used by active Pokemon is multiplied by 1.33."
    },
    "Filter": {
        "description": "This Pokemon receives 3/4 damage from supereffective attacks."
    },
    "Flame Body": {
        "description": "There is a 30% chance a Pokemon making contact with this Pokemon will be burned."
    },
    "Flare Boost": {
        "description": "While this Pokemon is burned, the power of its special attacks is multiplied by 1.5."
    },
    "Flash Fire": {
        "description": "This Pokemon is immune to Fire-type moves. The first time it is hit by a Fire-type move, its attacking stat is multiplied by 1.5 while using a Fire-type attack as long as it remains active and has this Ability. If this Pokemon is frozen, it cannot be defrosted by Fire-type attacks."
    },
    "Flower Gift": {
        "description": "If this Pokemon is a Cherrim and Sunny Day is active, it changes to Sunshine Form and the Attack and Special Defense of it and its allies are multiplied by 1.5."
    },
    "Flower Veil": {
        "description": "Grass-type Pokemon on this Pokemon's side cannot have their stat stages lowered by other Pokemon or have a major status condition inflicted on them by other Pokemon."
    },
    "Forecast": {
        "description": "If this Pokemon is a Castform, its type changes to the current weather condition's type, except Sandstorm."
    },
    "Forewarn": {
        "description": "On switch-in, this Pokemon is alerted to the move with the highest power, at random, known by an opposing Pokemon."
    },
    "Friend Guard": {
        "description": "This Pokemon's allies receive 3/4 damage from other Pokemon's attacks."
    },
    "Frisk": {
        "description": "On switch-in, this Pokemon identifies the held items of all opposing Pokemon."
    },
    "Fur Coat": {
        "description": "This Pokemon's Defense is doubled."
    },
    "Gale Wings": {
        "description": "This Pokemon's Flying-type moves have their priority increased by 1."
    },
    "Gluttony": {
        "description": "When this Pokemon has 1/2 or less of its maximum HP, rounded down, it uses certain Berries early."
    },
    "Gooey": {
        "description": "This Pokemon causes Pokemon making contact with it to have their Speed lowered by 1 stage."
    },
    "Grass Pelt": {
        "description": "If Grassy Terrain is active, this Pokemon's Defense is multiplied by 1.5."
    },
    "Guts": {
        "description": "If this Pokemon has a major status condition, its Attack is multiplied by 1.5; burn's physical damage halving is ignored."
    },
    "Harvest": {
        "description": "If the last item this Pokemon used is a Berry, there is a 50% chance it gets restored at the end of each turn. If Sunny Day is active, this chance is 100%."
    },
    "Healer": {
        "description": "There is a 30% chance of curing an adjacent ally's major status condition at the end of each turn."
    },
    "Heatproof": {
        "description": "The power of Fire-type attacks against this Pokemon is halved, and any burn damage taken is 1/16 of its maximum HP, rounded down."
    },
    "Heavy Metal": {
        "description": "This Pokemon's weight is doubled."
    },
    "Honey Gather": {
        "description": "No competitive use."
    },
    "Huge Power": {
        "description": "This Pokemon's Attack is doubled."
    },
    "Hustle": {
        "description": "This Pokemon's Attack is multiplied by 1.5 and the accuracy of its physical attacks is multiplied by 0.8."
    },
    "Hydration": {
        "description": "This Pokemon has its major status condition cured at the end of each turn if Rain Dance is active."
    },
    "Hyper Cutter": {
        "description": "Prevents other Pokemon from lowering this Pokemon's Attack stat stage."
    },
    "Ice Body": {
        "description": "If Hail is active, this Pokemon restores 1/16 of its maximum HP, rounded down, at the end of each turn. This Pokemon takes no damage from Hail."
    },
    "Illuminate": {
        "description": "No competitive use."
    },
    "Illusion": {
        "description": "When this Pokemon switches in, it appears as the last unfainted Pokemon in its party until it takes direct damage from another Pokemon's attack. This Pokemon's actual level and HP are displayed instead of those of the mimicked Pokemon."
    },
    "Immunity": {
        "description": "This Pokemon cannot be poisoned. Gaining this Ability while poisoned cures it."
    },
    "Imposter": {
        "description": "On switch-in, this Pokemon Transforms into the opposing Pokemon that is facing it. If there is no Pokemon at that position, this Pokemon does not Transform."
    },
    "Infiltrator": {
        "description": "This Pokemon's moves ignore substitutes and the opposing side's Reflect, Light Screen, Safeguard, and Mist."
    },
    "Inner Focus": {
        "description": "This Pokemon cannot be made to flinch."
    },
    "Insomnia": {
        "description": "This Pokemon cannot fall asleep. Gaining this Ability while asleep cures it."
    },
    "Intimidate": {
        "description": "On switch-in, this Pokemon lowers the Attack of adjacent opposing Pokemon by 1 stage. Pokemon behind a substitute are immune."
    },
    "Iron Barbs": {
        "description": "This Pokemon causes Pokemon making contact with it to lose 1/8 of their maximum HP, rounded down."
    },
    "Iron Fist": {
        "description": "This Pokemon's punch-based attacks have their power multiplied by 1.2."
    },
    "Justified": {
        "description": "This Pokemon's Attack is raised by 1 stage after it is damaged by a Dark-type attack."
    },
    "Keen Eye": {
        "description": "Prevents other Pokemon from lowering this Pokemon's accuracy stat stage. This Pokemon ignores a target's evasiveness stat stage."
    },
    "Klutz": {
        "description": "This Pokemon's held item has no effect. This Pokemon cannot use Fling successfully. Macho Brace, Power Anklet, Power Band, Power Belt, Power Bracer, Power Lens, and Power Weight still have their effects."
    },
    "Leaf Guard": {
        "description": "If Sunny Day is active, this Pokemon cannot gain a major status condition and Rest will fail for it."
    },
    "Levitate": {
        "description": "This Pokemon is immune to Ground. Gravity, Ingrain, Smack Down, and Iron Ball nullify the immunity."
    },
    "Light Metal": {
        "description": "This Pokemon's weight is halved."
    },
    "Lightningrod": {
        "description": "This Pokemon is immune to Electric-type moves and raises its Special Attack by 1 stage when hit by an Electric-type move. If this Pokemon is not the target of a single-target Electric-type move used by another Pokemon, this Pokemon redirects that move to itself if it is within the range of that move."
    },
    "Limber": {
        "description": "This Pokemon cannot be paralyzed. Gaining this Ability while paralyzed cures it."
    },
    "Liquid Ooze": {
        "description": "This Pokemon damages those draining HP from it for as much as they would heal."
    },
    "Magic Bounce": {
        "description": "This Pokemon blocks certain status moves and instead uses the move against the original user."
    },
    "Magic Guard": {
        "description": "This Pokemon can only be damaged by direct attacks. Curse and Substitute on use, Belly Drum, Pain Split, Struggle recoil, and confusion damage are considered direct damage."
    },
    "Magician": {
        "description": "If this Pokemon has no item, it steals the item off a Pokemon it hits with an attack. Does not affect Doom Desire and Future Sight."
    },
    "Magma Armor": {
        "description": "This Pokemon cannot be frozen. Gaining this Ability while frozen cures it."
    },
    "Magnet Pull": {
        "description": "Prevents adjacent opposing Steel-type Pokemon from choosing to switch out unless they are immune to trapping."
    },
    "Marvel Scale": {
        "description": "If this Pokemon has a major status condition, its Defense is multiplied by 1.5."
    },
    "Mega Launcher": {
        "description": "This Pokemon's pulse moves have their power multiplied by 1.5. Heal Pulse restores 3/4 of a target's maximum HP, rounded half down."
    },
    "Minus": {
        "description": "If an active ally has this Ability or the Ability Plus, this Pokemon's Special Attack is multiplied by 1.5."
    },
    "Mold Breaker": {
        "description": "This Pokemon's moves ignore the target's Ability if it could modify the effectiveness."
    },
    "Moody": {
        "description": "This Pokemon has a random stat raised by 2 stages and another stat lowered by 1 stage at the end of each turn."
    },
    "Motor Drive": {
        "description": "This Pokemon is immune to Electric-type moves and raises its Speed by 1 stage when hit by an Electric-type move."
    },
    "Moxie": {
        "description": "This Pokemon's Attack is raised by 1 stage if it attacks and knocks out another Pokemon."
    },
    "Multiscale": {
        "description": "If this Pokemon is at full HP, damage taken from attacks is halved."
    },
    "Multitype": {
        "description": "If this Pokemon is an Arceus, its type changes to match its held Plate."
    },
    "Mummy": {
        "description": "Pokemon making contact with this Pokemon have their Ability changed to Mummy. Does not affect the Ability Multitype or Stance Change."
    },
    "Natural Cure": {
        "description": "This Pokemon has its major status condition cured when it switches out."
    },
    "No Guard": {
        "description": "Every move used by or against this Pokemon will always hit."
    },
    "Normalize": {
        "description": "This Pokemon's moves are changed to be Normal type. This effect comes before other effects that change a move's type."
    },
    "Oblivious": {
        "description": "This Pokemon cannot be infatuated or taunted. Gaining this Ability while affected cures it."
    },
    "Overcoat": {
        "description": "This Pokemon is immune to powder moves and damage from Sandstorm or Hail."
    },
    "Overgrow": {
        "description": "When this Pokemon has 1/3 or less of its maximum HP, rounded down, its attacking stat is multiplied by 1.5 while using a Grass-type attack."
    },
    "Own Tempo": {
        "description": "This Pokemon cannot be confused. Gaining this Ability while confused cures it."
    },
    "Parental Bond": {
        "description": "This Pokemon's damaging attacks become multi-hit moves that hit twice. The second hit has its damage halved. Does not affect multi-hit moves or moves that have multiple targets."
    },
    "Pickpocket": {
        "description": "If this Pokemon has no item, it steals the item off a Pokemon that makes contact with it."
    },
    "Pickup": {
        "description": "If this Pokemon has no item, it finds one used by an adjacent Pokemon this turn."
    },
    "Pixilate": {
        "description": "This Pokemon's Normal-type moves become Fairy-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects."
    },
    "Plus": {
        "description": "If an active ally has this Ability or the Ability Minus, this Pokemon's Special Attack is multiplied by 1.5."
    },
    "Poison Heal": {
        "description": "If this Pokemon is poisoned, it restores 1/8 of its maximum HP, rounded down, at the end of each turn instead of losing HP."
    },
    "Poison Point": {
        "description": "There is a 30% chance a Pokemon making contact with this Pokemon will be poisoned."
    },
    "Poison Touch": {
        "description": "This Pokemon's contact moves have a 30% chance of poisoning."
    },
    "Prankster": {
        "description": "This Pokemon's non-damaging moves have their priority increased by 1."
    },
    "Pressure": {
        "description": "If this Pokemon is the target of an opposing Pokemon's move, that move loses one additional PP."
    },
    "Protean": {
        "description": "This Pokemon's type changes to match the type of the move it is about to use. This effect comes after all effects that change a move's type."
    },
    "Pure Power": {
        "description": "This Pokemon's Attack is doubled."
    },
    "Quick Feet": {
        "description": "If this Pokemon has a major status condition, its Speed is multiplied by 1.5; the Speed drop from paralysis is ignored."
    },
    "Rain Dish": {
        "description": "If Rain Dance is active, this Pokemon restores 1/16 of its maximum HP, rounded down, at the end of each turn."
    },
    "Rattled": {
        "description": "This Pokemon's Speed is raised by 1 stage if hit by a Bug-, Dark-, or Ghost-type attack."
    },
    "Reckless": {
        "description": "This Pokemon's attacks with recoil or crash damage have their power multiplied by 1.2. Does not affect Struggle."
    },
    "Refrigerate": {
        "description": "This Pokemon's Normal-type moves become Ice-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects."
    },
    "Regenerator": {
        "description": "This Pokemon restores 1/3 of its maximum HP, rounded down, when it switches out."
    },
    "Rivalry": {
        "description": "This Pokemon's attacks have their power multiplied by 1.25 against targets of the same gender or multiplied by 0.75 against targets of the opposite gender. There is no modifier if either this Pokemon or the target is genderless."
    },
    "Rock Head": {
        "description": "This Pokemon does not take recoil damage besides Struggle, Life Orb, and crash damage."
    },
    "Rough Skin": {
        "description": "This Pokemon causes Pokemon making contact with it to lose 1/8 of their maximum HP, rounded down."
    },
    "Run Away": {
        "description": "No competitive use."
    },
    "Sand Force": {
        "description": "If Sandstorm is active, this Pokemon's Ground-, Rock-, and Steel-type attacks have their power multiplied by 1.3. This Pokemon takes no damage from Sandstorm."
    },
    "Sand Rush": {
        "description": "If Sandstorm is active, this Pokemon's Speed is doubled. This Pokemon takes no damage from Sandstorm."
    },
    "Sand Stream": {
        "description": "On switch-in, this Pokemon summons Sandstorm."
    },
    "Sand Veil": {
        "description": "If Sandstorm is active, this Pokemon's evasiveness is multiplied by 1.25. This Pokemon takes no damage from Sandstorm."
    },
    "Sap Sipper": {
        "description": "This Pokemon is immune to Grass-type moves and raises its Attack by 1 stage when hit by a Grass-type move."
    },
    "Scrappy": {
        "description": "This Pokemon can hit Ghost types with Normal- and Fighting-type moves."
    },
    "Serene Grace": {
        "description": "This Pokemon's moves have their secondary effect chance doubled."
    },
    "Shadow Tag": {
        "description": "Prevents adjacent opposing Pokemon from choosing to switch out unless they are immune to trapping or also have this Ability."
    },
    "Shed Skin": {
        "description": "This Pokemon has a 33% chance to have its major status condition cured at the end of each turn."
    },
    "Sheer Force": {
        "description": "This Pokemon's attacks with secondary effects have their power multiplied by 1.3, but the secondary effects are removed."
    },
    "Shell Armor": {
        "description": "This Pokemon cannot be struck by a critical hit."
    },
    "Shield Dust": {
        "description": "This Pokemon is not affected by the secondary effect of another Pokemon's attack."
    },
    "Simple": {
        "description": "If this Pokemon's stat stages are raised or lowered, the effect is doubled instead."
    },
    "Skill Link": {
        "description": "This Pokemon's multi-hit attacks always hit the maximum number of times."
    },
    "Slow Start": {
        "description": "On switch-in, this Pokemon's Attack and Speed are halved for 5 turns."
    },
    "Sniper": {
        "description": "If this Pokemon strikes with a critical hit, the damage is multiplied by 1.5."
    },
    "Snow Cloak": {
        "description": "If Hail is active, this Pokemon's evasiveness is multiplied by 1.25. This Pokemon takes no damage from Hail."
    },
    "Snow Warning": {
        "description": "On switch-in, this Pokemon summons Hail."
    },
    "Solar Power": {
        "description": "If Sunny Day is active, this Pokemon's Special Attack is multiplied by 1.5 and it loses 1/8 of its maximum HP, rounded down, at the end of each turn."
    },
    "Solid Rock": {
        "description": "This Pokemon receives 3/4 damage from supereffective attacks."
    },
    "Soundproof": {
        "description": "This Pokemon is immune to sound-based moves, including Heal Bell."
    },
    "Speed Boost": {
        "description": "This Pokemon's Speed is raised by 1 stage at the end of each full turn it has been on the field."
    },
    "Stall": {
        "description": "This Pokemon moves last among Pokemon using the same or greater priority moves."
    },
    "Stance Change": {
        "description": "If this Pokemon is an Aegislash, it changes to Blade Forme before attempting to use an attacking move, and changes to Shield Forme before attempting to use King's Shield."
    },
    "Static": {
        "description": "There is a 30% chance a Pokemon making contact with this Pokemon will be paralyzed."
    },
    "Steadfast": {
        "description": "If this Pokemon flinches, its Speed is raised by 1 stage."
    },
    "Stench": {
        "description": "This Pokemon's attacks without a chance to flinch have a 10% chance to flinch."
    },
    "Sticky Hold": {
        "description": "This Pokemon cannot lose its held item due to another Pokemon's attack."
    },
    "Storm Drain": {
        "description": "This Pokemon is immune to Water-type moves and raises its Special Attack by 1 stage when hit by a Water-type move. If this Pokemon is not the target of a single-target Water-type move used by another Pokemon, this Pokemon redirects that move to itself if it is within the range of that move."
    },
    "Strong Jaw": {
        "description": "This Pokemon's bite-based moves have their power multiplied by 1.5."
    },
    "Sturdy": {
        "description": "If this Pokemon is at full HP, it survives one hit with at least 1 HP. OHKO moves fail when used against this Pokemon."
    },
    "Suction Cups": {
        "description": "This Pokemon cannot be forced to switch out by another Pokemon's attack or item."
    },
    "Super Luck": {
        "description": "This Pokemon's critical hit ratio is raised by 1 stage."
    },
    "Swarm": {
        "description": "When this Pokemon has 1/3 or less of its maximum HP, rounded down, its attacking stat is multiplied by 1.5 while using a Bug-type attack."
    },
    "Sweet Veil": {
        "description": "This Pokemon and its allies cannot fall asleep."
    },
    "Swift Swim": {
        "description": "If Rain Dance is active, this Pokemon's Speed is doubled."
    },
    "Symbiosis": {
        "description": "If an ally uses its item, this Pokemon gives its item to that ally immediately. Does not activate if the ally's item was stolen or knocked off."
    },
    "Synchronize": {
        "description": "If another Pokemon burns, paralyzes, poisons, or badly poisons this Pokemon, that Pokemon receives the same major status condition."
    },
    "Tangled Feet": {
        "description": "This Pokemon's evasiveness is doubled as long as it is confused."
    },
    "Technician": {
        "description": "This Pokemon's attacks of 60 Base Power or less have their power multiplied by 1.5. Does affect Struggle."
    },
    "Telepathy": {
        "description": "This Pokemon does not take damage from attacks made by its allies."
    },
    "Teravolt": {
        "description": "This Pokemon's moves ignore the target's Ability if it could modify the effectiveness."
    },
    "Thick Fat": {
        "description": "If a Pokemon uses a Fire- or Ice-type attack against this Pokemon, that Pokemon's attacking stat is halved while using the attack."
    },
    "Tinted Lens": {
        "description": "This Pokemon's attacks that are not very effective on a target have their damage doubled."
    },
    "Torrent": {
        "description": "When this Pokemon has 1/3 or less of its maximum HP, rounded down, its attacking stat is multiplied by 1.5 while using a Water-type attack."
    },
    "Tough Claws": {
        "description": "This Pokemon's contact moves have their power multiplied by 1.3."
    },
    "Toxic Boost": {
        "description": "While this Pokemon is poisoned, the power of its physical attacks is multiplied by 1.5."
    },
    "Trace": {
        "description": "On switch-in, this Pokemon copies a random adjacent opposing Pokemon's Ability. If there is no Ability that can be copied at that time, this Ability will activate as soon as an Ability can be copied. Abilities that cannot be copied are Flower Gift, Forecast, Illusion, Imposter, Multitype, Stance Change, Trace, and Zen Mode."
    },
    "Truant": {
        "description": "This Pokemon skips every other turn instead of using a move."
    },
    "Turboblaze": {
        "description": "This Pokemon's moves ignore the target's Ability if it could modify the effectiveness."
    },
    "Unaware": {
        "description": "This Pokemon ignores other Pokemon's Attack, Special Attack, and accuracy stat stages when taking damage, and ignores other Pokemon's Defense, Special Defense, and evasiveness stat stages when dealing damage."
    },
    "Unburden": {
        "description": "If this Pokemon loses its held item for any reason, its Speed is doubled. This boost is lost if it switches out or gains a new item or Ability."
    },
    "Unnerve": {
        "description": "While this Pokemon is active, it prevents opposing Pokemon from using their Berries."
    },
    "Victory Star": {
        "description": "This Pokemon and its allies' moves have their accuracy multiplied by 1.1."
    },
    "Vital Spirit": {
        "description": "This Pokemon cannot fall asleep. Gaining this Ability while asleep cures it."
    },
    "Volt Absorb": {
        "description": "This Pokemon is immune to Electric-type moves and restores 1/4 of its maximum HP, rounded down, when hit by an Electric-type move."
    },
    "Water Absorb": {
        "description": "This Pokemon is immune to Water-type moves and restores 1/4 of its maximum HP, rounded down, when hit by a Water-type move."
    },
    "Water Veil": {
        "description": "This Pokemon cannot be burned. Gaining this Ability while burned cures it."
    },
    "Weak Armor": {
        "description": "If a physical attack hits this Pokemon, its Defense is lowered by 1 stage and its Speed is raised by 1 stage."
    },
    "White Smoke": {
        "description": "Prevents other Pokemon from lowering this Pokemon's stat stages."
    },
    "Wonder Guard": {
        "description": "This Pokemon can only be damaged by supereffective moves and indirect damage."
    },
    "Wonder Skin": {
        "description": "All non-damaging moves that check accuracy have their accuracy changed to 50% when used on this Pokemon."
    },
    "Zen Mode": {
        "description": "If this Pokemon is a Darmanitan, it changes to Zen Mode if it has 1/2 or less of its maximum HP at the end of a turn. If Darmanitan's HP is above 1/2 of its maximum HP at the end of a turn, it changes back to Standard Mode. If Darmanitan loses this Ability while in Zen Mode it reverts to Standard Mode immediately."
    }
}
